import React from 'react'
import './Main.scss'
import pine from './pine.jpg';  

const Main = props => (
    <div className="Main">
    <p>   
    Хвойные деревья

{<br/>} {<br/>}
Сосна́ (лат. Pínus) — типовой род хвойных деревьев семейства Сосновые (Pinaceae). 
По современным данным в мире насчитывается около 120 видов[6] сосны, которые в естественном произрастании рассеяны по всему 
Северному полушарию от экватора до заполярья. В умеренном и субарктическом климате они образуют леса на равнинах, а в субтропиках, 
тропиках и вблизи экватора произрастают в горах. Используется не только как источник древесины, но и в химической и фармацевтической промышленности.
 Плодоносящие виды сосны, дающие съедобные орехи, условно объединяются под названием кедровые сосны. Однако надо помнить, что Кедр (Cedrus) — другой род деревьев 
 того же семейства, а семена сосны не являются орехами в ботаническом смысле.
{<br/>}{<br/>}
Сосна относится к весьма светолюбивым древесным породам, однако зачастую образует чистые насаждения — сосновый бор.
 Причина этого явления заключается в том, что сосна являясь одной из наименее требовательных к почве древесных пород, 
 может расти на таких малоплодородных почвах, на которых рост других деревьев оказывается почти невозможным. 
 Такое преимущество соснам даёт поверхностный тип корневой системы, который может развиваться в тонком (1—2 см) слое плодородной почвы, 
 лежащей на песках. Например, в Карелии сосны могут иметь обширную корневую систему (имея отдельные корневые побеги длиной до 20 метров у взрослых деревьев), 
 расположенную в слое всего 1 см толщиной. Такими типичными для чистых сосновых насаждений почвами являются сухие песчаные, на которых и заселяются сосновые боры.
  Характерной особенностью таких боров является их одновозрастность, объясняемая тем, что даже в наименее населённых местностях они сильно страдают от лесных пожаров и,
   легко обсеменяясь после каждого из них, вырастают вновь в виде одновозрастных насаждений.
   {<br/>} {<br/>}
Ель (лат. Pícea) — род деревьев семейства Сосновые (Pinaceae). Насчитывает около 35 видов вечнозелёных высоких деревьев (до 30 м высотой) с красивой кроной.
 Ель является одним из главных символов европейского Нового года и Рождества.
 {<br/>} {<br/>}
Кедр (лат. Cedrus) — олиготипный род деревьев семейства Сосновые (Pinaceae). В природе ареал рода охватывает южные и восточные горные районы
 Средиземноморья и западные районы Гималаев. Представители рода однодомные, вечнозелёные деревья высотой до 40—50 метров, с раскидистой кроной. 
 Кора тёмно-серая, на молодых стволах гладкая, на старых растрескивающаяся, чешуйчатая. Хвоя игловидная, трёх- или четырёхгранная, жёсткая, колючая, тёмно- 
 или сине-зелёная до серебристо-серой, со всех сторон снабженная устьицами, сидит на листовых подушках, собрана в пучки по 30—40 шт. Побеги укороченные и удлинённые, 
 последние несут спирально расположенную хвою. Семена, ввиду смолистости, не поедаются грызунами. Растения требуют не уплотнённой сверху и хорошо водопроницаемых почв;
  очень чувствительны к застаиванию воды в почве (особенно кедр гималайский (Cedrus deodara)). Благодаря своей декоративности и быстроте роста кедры ценны для парковых 
  насаждений как в группах, так и одиночно. Особенно ценны голубые и серебристые формы.
  {<br/>} {<br/>}
Ли́ственница (лат. Lárix) — род древесных растений семейства Сосновые, одна из наиболее распространённых пород хвойных деревьев.
 Хвоя однолетняя, мягкая. Сплюснутая, ярко-зелёная, расположена на удлинённых побегах спирально и поодиночке, а на укороченных — пучками,
  до 40 штук в каждом. В благоприятных условиях вырастает до 50 и более метров в высоту при диаметре ствола до 1 м и более. Доживает до 300—400 лет,
   зарегистрированы лиственницы возрастом до 800 лет.
   {<br/>} {<br/>}
Пи́хта (лат. Ábies) — род голосеменных растений семейства Сосновые (Pinaceae). Пирамидальные деревья, несущие кольчато расположенные горизонтальные ветви.
 Листья игольчатые (хвоя), плоские, у основания суженные в короткий черешок. Распространены в умеренных областях Северного полушария. Наиболее богатые видами области:
  запад Северной Америки (побережье Тихого океана) и Восточная Азия (особенно Япония). Характерная особенность пихт — шишки у них, в отличие от других хвойных, растут вверх.
  {<br/>}  {<br/>}
Тсу́га (лат. Tsúga) — род хвойных вечнозелёных деревьев семейства Сосновые (Pinaceae). Вечнозелёные деревья средних либо крупных размеров, 
высотой 20—65 метров. Крона коническая либо несимметрично яйцевидная (у некоторых азиатских видов), основные побеги обычно опадают, свисают.
 Кора серая или коричневая, чешуйчатая, часто с глубокими трещинами. Ветви горизонтальные, часто сплющены и изогнуты вниз. Укороченные побеги умеренно развитые;
  молодые веточки и периферийные части стебля извилистые и свисающие, грубеют от крючковатых выступов после того, как лист опадает. Распространена в умеренных широтах Азии
   (Гималаи, Китай, Япония) и Северной Америки. Родиной считается Япония. На территории России и сопредельных стран интродуцировано (ввезено) несколько видов, в том 
   числе Тсуга канадская (Tsuga canadensis) и Тсуга разнолистная (Tsuga diversifolia).
     </p>
 
     <div className="divPine"> 
         <img src={pine} className="pine"/>
     </div>  
     
    </div>   
)

export default Main